{
  "fileInfo": {
    "fileId": "KF_08_CASE_STUDIES",
    "version": "1.0",
    "description": "A structured database of completed projects, serving as the central repository for marketing proof points, client testimonials, and before-and-after evidence. This file directly feeds the '*Proof In Every Roof*' philosophy.",
    "lastUpdated": "2025-10-04T00:01:16AEST",
    "currency": "AUD"
  },
  "caseStudies": [
    {
      "caseStudyId": "CS-2025-09-15-BER-01",
      "jobDate": "2025-09-15",
      "location": {
        "suburb": "Berwick",
        "region": "SE Melbourne"
      },
      "jobType": "Full Tile Roof Restoration",
      "roofDetails": {
        "roofType": "Concrete Tile",
        "pitch": "Standard 22°",
        "storeys": 1
      },
      "narrative": {
        "clientProblem": "Client reported their 20-year-old roof looked 'tired and faded'. They were concerned about extensive moss growth and visible cracking in the ridge capping mortar, and worried about potential leaks.",
        "diagnosticFindings": "Our Roof Health Check confirmed significant moss and lichen across all roof faces. The original pointing had failed in multiple sections, with severe cracking and mortar loss. Approximately 15 tiles were cracked or broken. The overall surface of the tiles was porous and faded.",
        "solutionProvided": "A full restoration was performed as per SOP-T4. This included a high-pressure clean (SOP-T1), replacement of 18 cracked concrete tiles (SOP-T2), and a full re-bed and re-point of all ridge capping (SOP-T3). A 3-coat system was applied: one coat of Premcoat Primer/Sealer and two top coats of Premcoat membrane in 'Monument'."
      },
      "keyOutcomes": [
        "Complete aesthetic transformation, increasing kerb appeal and property value.",
        "Structural integrity of ridge capping restored, eliminating leak risk.",
        "All broken tiles replaced, securing the roof envelope.",
        "New paint membrane provides long-term UV and weather protection."
      ],
      "materialsUsed": [
        { "itemId": "MAT_TILE_REPC_CONC", "quantity": 18 },
        { "itemId": "MAT_TILE_MORTAR_20KG", "quantity": 5 },
        { "itemId": "MAT_TILE_FLEXPOINT_15L", "quantity": 2 },
        { "itemId": "MAT_TILE_PRIMER_20L", "quantity": 2 },
        { "itemId": "MAT_TILE_PAINT_15L_PREM", "quantity": 3 }
      ],
      "proofPackage": {
        "beforeImageFilenames": ["ber01_before_wide.jpg", "ber01_before_ridge_closeup.jpg", "ber01_before_moss.jpg"],
        "afterImageFilenames": ["ber01_after_wide.jpg", "ber01_after_ridge_closeup.jpg", "ber01_after_angle.jpg"],
        "videoLink": "https://our-site.com/videos/berwick-restoration-1"
      },
      "clientTestimonial": "Could not be happier with the result. The team was professional from start to finish. Our roof looks brand new and the whole house looks better for it. The photo updates they sent were fantastic. Highly recommend.",
      "tags": ["tile_restoration", "berwick", "moss_removal", "ridge_capping", "roof_painting", "concrete_tile"]
    },
    {
      "caseStudyId": "CS-2025-08-22-CRN-01",
      "jobDate": "2025-08-22",
      "location": {
        "suburb": "Cranbourne North",
        "region": "SE Melbourne"
      },
      "jobType": "Metal Roof Painting",
      "roofDetails": {
        "roofType": "Corrugated Metal (Colorbond)",
        "pitch": "Low 15°",
        "storeys": 1
      },
      "narrative": {
        "clientProblem": "Client's Colorbond roof had severely faded from its original 'Woodland Grey' colour to a chalky, light grey. There were several areas of surface rust, particularly around fasteners.",
        "diagnosticFindings": "Inspection confirmed widespread oxidation (chalking) of the original paint finish. Surface rust was present on approximately 30% of the fasteners and in several scratches on the sheets. No deep corrosion or perforation was found.",
        "solutionProvided": "Work was conducted as per subcontractor doctrine KF_04. The roof was pressure cleaned (SOP-M1), all rust spots were mechanically ground back to bare metal and treated with a rust converter (SOP-M2). All 450+ fasteners were systematically replaced with new Class 4 screws (SOP-M4). A full 3-coat system was applied: one coat of metal primer and two top coats of membrane in 'Woodland Grey'."
      },
      "keyOutcomes": [
        "Full restoration of original roof colour and sheen.",
        "All rust treated and eliminated, preventing future corrosion.",
        "All fasteners replaced, ensuring long-term waterproofing.",
        "Extended the life of the roof for a fraction of the cost of replacement."
      ],
      "materialsUsed": [
        { "itemId": "MAT_METAL_SCREWS_100", "quantity": 5 },
        { "itemId": "MAT_METAL_PRIMER_15L", "quantity": 1 },
        { "itemId": "MAT_METAL_PAINT_15L", "quantity": 2 }
      ],
      "proofPackage": {
        "beforeImageFilenames": ["crn01_before_fade.jpg", "crn01_before_rust_screw.jpg"],
        "afterImageFilenames": ["crn01_after_wide.jpg", "crn01_after_sheen.jpg"],
        "videoLink": null
      },
      "clientTestimonial": null,
      "tags": ["metal_roof", "cranbourne", "roof_painting", "colorbond", "rust_treatment", "fastener_replacement"]
    },
    {
      "caseStudyId": "CS-2025-07-30-PAK-01",
      "jobDate": "2025-07-30",
      "location": {
        "suburb": "Pakenham",
        "region": "SE Melbourne"
      },
      "jobType": "Ridge Capping Repair",
      "roofDetails": {
        "roofType": "Terracotta Tile",
        "pitch": "Steep 25°",
        "storeys": 2
      },
      "narrative": {
        "clientProblem": "Client noticed pieces of mortar falling onto their driveway and was concerned about the security of their ridge capping during high winds.",
        "diagnosticFindings": "The inspection revealed that the original bedding mortar was completely brittle and had failed along the entire main ridge and two hips. The flexible pointing on top had cracked and was peeling away, offering no waterproofing. Several ridge caps were loose to the touch.",
        "solutionProvided": "A full re-bed and re-point of the main ridge and two hips was performed as per SOP-T3. All ridge caps were removed, all old mortar was chipped away, and a new, solid mortar bed was applied. Weep holes were formed. A new, thick bead of flexible pointing was applied and tooled to a professional finish.",
        "keyOutcomes": [
          "Ridge capping is now structurally sound and secure against wind lift.",
          "The primary leak point on the roof has been eliminated.",
          "The clean, new pointing lines have improved the roof's overall appearance."
        ],
        "materialsUsed": [
          { "itemId": "MAT_TILE_MORTAR_20KG", "quantity": 4 },
          { "itemId": "MAT_TILE_FLEXPOINT_15L", "quantity": 1 }
        ],
        "proofPackage": {
          "beforeImageFilenames": ["pak01_before_cracked.jpg", "pak01_before_mortar_gone.jpg"],
          "afterImageFilenames": ["pak01_after_closeup.jpg", "pak01_after_ridgeline.jpg"],
          "videoLink": null
        },
        "clientTestimonial": "Very happy with the work. They showed me photos of the problem so I could understand what was needed. The finished job looks great and I feel much safer now.",
        "tags": ["ridge_capping", "pakenham", "rebedding", "repointing", "leak_repair", "terracotta_tile"]
    },
    {
      "caseStudyId": "CS-2025-06-18-NAR-01",
      "jobDate": "2025-06-18",
      "location": {
        "suburb": "Narre Warren South",
        "region": "SE Melbourne"
      },
      "jobType": "Valley Iron Replacement",
      "roofDetails": {
        "roofType": "Concrete Tile",
        "pitch": "Standard 22°",
        "storeys": 1
      },
      "narrative": {
        "clientProblem": "Client had a persistent leak that was causing a water stain on their ceiling in the living room. They had a handyman attempt to 'fix' it with silicone, but it continued to leak.",
        "diagnosticFindings": "Our leak detection process (Protocol U-2R) traced the source to the main valley. The old valley iron had rusted through in several places, creating perforations. The previous handyman had simply applied silicone over the rust, which is a guaranteed failure.",
        "solutionProvided": "The tiles on both sides of the valley were removed. The old, rusted valley iron was cut out and disposed of. New, galvanized valley iron was installed with the correct overlaps. The tiles were re-cut where necessary and re-laid, secured with clips.",
        "keyOutcomes": [
          "Root cause of the persistent leak was permanently eliminated.",
          "Prevented major potential water damage to the client's internal roof structure and ceiling.",
          "Restored the roof's primary water-channelling system."
        ],
        "materialsUsed": [
          { "itemId": "REP_VALLEY_IRON_LM", "quantity": 6 }
        ],
        "proofPackage": {
          "beforeImageFilenames": ["nar01_before_rusted_valley.jpg", "nar01_before_bad_silicone.jpg"],
          "afterImageFilenames": ["nar01_after_new_valley.jpg", "nar01_after_tiles_relaid.jpg"],
          "videoLink": null
        },
        "clientTestimonial": "Finally, someone who could actually find and fix the leak! Professional, explained everything clearly. Worth every cent.",
        "tags": ["valley_iron", "narre_warren", "leak_repair", "concrete_tile", "water_damage"]
    },
    {
      "caseStudyId": "CS-2025-05-20-CLY-01",
      "jobDate": "2025-05-20",
      "location": {
        "suburb": "Clyde North",
        "region": "SE Melbourne"
      },
      "jobType": "Gutter Cleaning",
      "roofDetails": {
        "roofType": "Concrete Tile",
        "pitch": "Standard 22°",
        "storeys": 2
      },
      "narrative": {
        "clientProblem": "During heavy rain, water was overflowing from the gutters at the front of the client's two-storey home.",
        "diagnosticFindings": "Inspection revealed that the gutters were completely full of leaves, silt, and sludge, particularly around the downpipe openings, causing water to dam up and overflow.",
        "solutionProvided": "A full gutter and downpipe clean was performed as per SOP-GR5. All solid debris was manually removed by hand. The entire gutter system was then flushed with a pressure hose to remove the remaining silt. All downpipes were flushed and confirmed to be flowing freely.",
        "keyOutcomes": [
          "Roof drainage system restored to full capacity.",
          "Prevented potential water damage to fascias, eaves, and the building's foundation from overflowing water.",
          "Identified and removed a fire hazard (dry leaves in gutters)."
        ],
        "materialsUsed": [],
        "proofPackage": {
          "beforeImageFilenames": ["cly01_before_full_gutter.jpg"],
          "afterImageFilenames": ["cly01_after_clean_gutter.jpg"],
          "videoLink": null
        },
        "clientTestimonial": "Fast, efficient, and did a great job. Much safer than me trying to get up on a ladder myself.",
        "tags": ["gutter_cleaning", "clyde", "maintenance", "water_damage"]
    }
  ]
}
